app/controllers/articles_controller.rb

	def update
		@article = Article.find(params[:id])
		@article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 14]]
UPDATE "articles" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_updated_at", "2016-04-13 01:54:12.813144"], ["image_file_name", "beast.png"], ["updated_at", "2016-04-13 01:54:12.910915"], ["id", 20]]